[
  {
    "content": "API Endpoints\nHubSpot API reference\nHubSpot API reference\nHubSpot’s developer platform is a core part of our mission to empower organizations to\ngrow better\n. Our APIs are designed to enable teams of any shape or size to build robust integrations that help them customize and get the most value out of HubSpot.\nAll HubSpot APIs are\nbuilt using REST conventions\nand designed to have a predictable URL structure. They use many standard HTTP features, including methods (\nPOST\n,\nGET\n,\nPUT\n,\nDELETE\n) and error response codes.\nAll HubSpot API calls are made under\nhttps://api.hubapi.com\nand all responses return standard JSON.\nIn this section of the docs site, you'll find lists of all available endpoints for a given API, along with interactive code blocks for building requests. For walkthroughs of basic usage for these APIs, check out the\nAPI guides\n.\nSetting up\nThere are several ways to build integrations with HubSpot:"
  },
  {
    "content": "API guides\n.\nSetting up\nThere are several ways to build integrations with HubSpot:\nTo build an internal integration for an individual HubSpot account (e.g., you want to build an app that can access and edit only authorized parts of your account to share or integrate with other parts of your organization), create a\nprivate app\n.\nIf you're looking to create a public app that can be installed across multiple HubSpot accounts, you should\ncreate a developer account\n. A developer account is where you create HubSpot apps, each authenticated with OAuth and provided with a configurable set of features and permissions. You can also use your developer account to\ncreate test accounts\n, monitor app status and performance, or publish apps to the HubSpot App Marketplace.\nLearn more about the\ndifferent types of apps and how to build them\n.\nClient libraries"
  },
  {
    "content": "create test accounts\n, monitor app status and performance, or publish apps to the HubSpot App Marketplace.\nLearn more about the\ndifferent types of apps and how to build them\n.\nClient libraries\nClient libraries are designed to help you interact with the HubSpot APIs with less friction. They are written in several different languages and help bridge the gap between your app and HubSpot’s APIs. Each client library provides functions to access HubSpot's APIs so you don't need to know the exact URL and HTTP method to use for each API call, leaving you more time to focus on building your app.\nLanguage\nPackage Link\nSource Code\nNode.Js\nnpm install @hubspot/api-client\nhubspot-api-nodejs\nPHP\ncomposer require hubspot/api-client\nhubspot-api-php\nRuby\ngem install hubspot-api-client\nhubspot-api-ruby\nPython\npip install hubspot-api-client\nhubspot-api-python\nUsing the documentation"
  },
  {
    "content": "PHP\ncomposer require hubspot/api-client\nhubspot-api-php\nRuby\ngem install hubspot-api-client\nhubspot-api-ruby\nPython\npip install hubspot-api-client\nhubspot-api-python\nUsing the documentation\nEach set of API endpoints includes reference documentation that details the available parameters and provides example requests in multiple languages, and a guide that walks you through the functionality of each endpoint. A link to the corresponding guide for an API will be included at the top of each page for easy navigation.\nIn the reference documentation for a given API, several options are available to help you test out a given endpoint:\nAbove the\nRequest\ncode block for each endpoint, you can click\nTest call\nto make test calls directly from the page.\nYou can paste in an OAuth access token if you're building a\npublic app\n, or a private app access token if you're building a\nprivate app\n.\nClick\nSend request"
  },
  {
    "content": "to make test calls directly from the page.\nYou can paste in an OAuth access token if you're building a\npublic app\n, or a private app access token if you're building a\nprivate app\n.\nClick\nSend request\nto make a call to your app with any test parameters that you populate on the left side of the page.\nAt the top of API reference pages, a\nRun in Postman\nbutton is displayed when the API is available in\nHubSpot's Postman collection\n. Learn more about\nusing Postman\nto make API requests to HubSpot.\nWhen you're ready to implement an API in your integration, you can consult the documentation about general app development, including\nauthentication\nand\nlisting apps on the App Marketplace\n. You'll also find guides for\nbuilding UI extensions (BETA)\nand working with the\ndeveloper projects framework (BETA)\n.\nBuilding on HubSpot's CMS\nWhile the API reference documentation includes information about using HubSpot's CMS APIs, such as the\npages API"
  },
  {
    "content": "and working with the\ndeveloper projects framework (BETA)\n.\nBuilding on HubSpot's CMS\nWhile the API reference documentation includes information about using HubSpot's CMS APIs, such as the\npages API\n, you'll find the full set of CMS developer documentation at\nhttps://developers.hubspot.com/docs/cms\n. This includes guides that walk through building various CMS assets as well as reference documentation for HubL.\nSupport and community resources\nGet your questions answered, make connections, and share your insights by joining HubSpot’s growing\ndeveloper community forums\nand\nSlack community\n. These forums are a great place to make your voice heard — community feedback is incredibly important to us and our ongoing efforts to improve HubSpot’s developer experience.\nYou can also stay up to date on new features, announcements, and important changes by subscribing to the\nChangelog\nblog."
  },
  {
    "content": "--- FIM DA PÁGINA ---"
  },
  {
    "content": "Apps\nPrivate apps\nPrivate apps\nPrivate apps\nPrivate apps allow you to use HubSpot's APIs to access specific data from your HubSpot account. You can authorize what each private app can request or change in your account, which will generate an access token that's unique to your app.\nYou must be a\nsuper admin\nto access private apps in your HubSpot account.\nPlease note:\nPrivate apps do not support custom timeline events. Webhooks are\nsupported in private apps\n, but subscriptions cannot be edited programmatically via an API, and must instead be edited in your private app settings.\nIf you plan on building an app using custom timeline events, you should create a public app instead. Learn more about the\ndifferences between private and public apps\n.\nCreate a private app\nIn your HubSpot account, click the\nsettings icon\nin the main navigation bar.\nIn the left sidebar menu, navigate to\nIntegrations\n>\nPrivate Apps\n.\nClick\nCreate private app\n.\nOn the\nBasic Info"
  },
  {
    "content": "In your HubSpot account, click the\nsettings icon\nin the main navigation bar.\nIn the left sidebar menu, navigate to\nIntegrations\n>\nPrivate Apps\n.\nClick\nCreate private app\n.\nOn the\nBasic Info\ntab, configure the details of your app:\nEnter your app's\nname\n.\nHover over the placeholder logo and click the\nupload icon\nto upload a square image that will serve as the logo for your app.\nEnter a\ndescription\nfor your app.\nClick the\nScopes\ntab.\nAt the top of the page, click\nAdd new scope\n.\nIn the right panel, select the\ncheckbox\nfor each scope you want your private app to be able to access.\nYou can also search for a specific scope using the\nFind a scope\nsearch bar. You can review a full list of available scopes in\nthis reference article\n.\nClick\nUpdate\nwhen you're done adding scopes. If you later decide that your app requires additional scopes, you can also configure them after your app is created."
  },
  {
    "content": "this reference article\n.\nClick\nUpdate\nwhen you're done adding scopes. If you later decide that your app requires additional scopes, you can also configure them after your app is created.\nReview the scopes you've selected for your app. If you decide your app does not require a specific scope, you can click\nDelete\nnext to that scope to remove it. You can also click\nSummary of selected scopes\nto view a breakdown of your app's scopes and the associated access granted for each one.\nTo subscribe to events triggered by changes to CRM objects in your account, you can set up webhook subscriptions for your private app:\nAt the top of the page, Click the\nWebhooks\ntab.\nUnder\nTarget URL\n, enter the\nURL\nthat HubSpot will make a\nPOST\nrequest to when events trigger.\nClick\nCreate subscription\n.\nIn the right panel, select the\nobject types\nthat you want to subscribe to, then select the\nevents"
  },
  {
    "content": "URL\nthat HubSpot will make a\nPOST\nrequest to when events trigger.\nClick\nCreate subscription\n.\nIn the right panel, select the\nobject types\nthat you want to subscribe to, then select the\nevents\nassociated with those objects (e.g., created, merged, deleted, etc.) that will trigger HubSpot to send a request to the endpoint you configured.\nIf you select an object type that requires additional scopes you haven't authorized, you'll be prompted to add those scopes to your app.\nIf you select\nProperty changed\nfor the event type, you can then select any of the associated object properties that you want to subscribe to changes for.\nClick\nSubscribe\n.\nIf you don't want your webhook subscriptions to be active immediately, or if you want to delete a subscription you mistakenly created, you can hover over the webhook and manage its status, unsubscribe to delete it, or review the subscription details. Learn more about using webhook subscriptions in a private app in\nthis article\n."
  },
  {
    "content": "this article\n.\nAfter you're done configuring your app, click\nCreate app\nin the top right.\nIn the dialog box, review the info about your app's access token, then click\nContinue creating\n.\nOnce you've created your app, you can start making API calls using the app's access token. If you need to edit your app's info or change its scopes, click\nEdit app\nin the top right of the app details page.\nMake API calls with your app's access token\nPlease note:\nPrivate apps will lose access to scopes when your HubSpot account is downgraded and loses access to functionality. For example, if your account does not have access to HubDB, your private app will not have access to the HubDB scope.\nPrivate app access tokens will be updated to reflect available scopes in your HubSpot account and what you configured for the private app, but the token string itself will not change.\nTo start making API calls, navigate to the details page of your app.\nIn your HubSpot account, click the\nsettings icon"
  },
  {
    "content": "To start making API calls, navigate to the details page of your app.\nIn your HubSpot account, click the\nsettings icon\nin the main navigation bar.\nIn the left sidebar menu, navigate to\nIntegrations\n>\nPrivate apps\n.\nClick the\nname\nof your app.\nClick the\nAuth\ntab, click\nShow token\nto reveal your access token. Click\nCopy\nto copy the token to your clipboard.\nYou can then paste the access token to provide it to your developers, or use it yourself as you develop your app. When making a call to one of the HubSpot API endpoints, set the value of the\nAuthorization\nfield to\nBearer [YOUR_TOKEN]\n. For example, if you're making a call to the\nContacts API\nusing Node.js and\naxios\n, the request would look like the following:\nCopy code snippet\naxios.get(\n  'https://api.hubapi.com/crm/v3/objects/contacts',\n  {\n    headers: {\n      Authorization: `Bearer ${YOUR_TOKEN}`,\n      'Content-Type': 'application/json',\n    },\n  },\n  (err, data) => {\n    // Handle the API response\n  }\n);\n1\naxios\n.\nget\n(\n2"
  },
  {
    "content": "{\n    headers: {\n      Authorization: `Bearer ${YOUR_TOKEN}`,\n      'Content-Type': 'application/json',\n    },\n  },\n  (err, data) => {\n    // Handle the API response\n  }\n);\n1\naxios\n.\nget\n(\n2\n'https://api.hubapi.com/crm/v3/objects/contacts'\n,\n3\n{\n4\nheaders\n: {\n5\nAuthorization\n:\n`Bearer ${\nYOUR_TOKEN\n}`\n,\n6\n'Content-Type'\n:\n'application/json'\n,\n7\n},\n8\n},\n9\n(\nerr\n,\ndata\n)\n=>\n{\n10\n// Handle the API response\n11\n}\n12\n);\nPrivate app access tokens are implemented on top of OAuth, so you can also make authenticated calls with your access token using one of HubSpot's client libraries. For example, if you're using the\nNode.js client library\n, you can instantiate an OAuth client by passing in your app's access token:\nCopy code snippet\nconst hubspotClient = new hubspot.Client({ accessToken: YOUR_ACCESS_TOKEN });\nxxxxxxxxxx\nconst\nhubspotClient\n=\nnew\nhubspot\n.\nClient\n({\naccessToken\n:\nYOUR_ACCESS_TOKEN\n});\nPlease note:\nIf you\nremove the user"
  },
  {
    "content": "xxxxxxxxxx\nconst\nhubspotClient\n=\nnew\nhubspot\n.\nClient\n({\naccessToken\n:\nYOUR_ACCESS_TOKEN\n});\nPlease note:\nIf you\nremove the user\nwho originally created a private app, any API calls that previously used the app's access token will fail with a\nresult\nof\n\"USER_DOES_NOT_HAVE_PERMISSIONS\"\n. If this issue occurs, it's recommended that you follow\nthe instructions in the section below\nto rotate your access token.\nIf you mistakenly removed the user from your account,\nadding them back\nwill also fix the issue.\nView private app access token information\nTo view information about a private app's access token, such as the Hub ID and scopes associated with the token, make a\nPOST\nrequest to\n/oauth/v2/private-apps/get/access-token-info\n. In the request body, include your access token:\nCopy code snippet\n// POST request response body\n{\n  \"tokenKey\": {{accessToken}}\n}\nxxxxxxxxxx\n4\n1\n// POST request response body\n2\n{\n3\n\"tokenKey\"\n: {{\naccessToken\n}}\n4\n}"
  },
  {
    "content": "Copy code snippet\n// POST request response body\n{\n  \"tokenKey\": {{accessToken}}\n}\nxxxxxxxxxx\n4\n1\n// POST request response body\n2\n{\n3\n\"tokenKey\"\n: {{\naccessToken\n}}\n4\n}\nThe response will include information about the user who created the token, the Hub ID of the account, the private app ID, and the scopes associated with the token.\nCopy code snippet\n// Example response for GET request to /oauth/v2/private-apps/get/access-token-info\n{\n  \"userId\": 123456,\n  \"hubId\": 1020304,\n  \"appId\": 2011410,\n  \"scopes\": [\"oauth\", \"crm.schemas.companies.write\"]\n}\nxxxxxxxxxx\n7\n1\n// Example response for GET request to /oauth/v2/private-apps/get/access-token-info\n2\n{\n3\n\"userId\"\n:\n123456\n,\n4\n\"hubId\"\n:\n1020304\n,\n5\n\"appId\"\n:\n2011410\n,\n6\n\"scopes\"\n: [\n\"oauth\"\n,\n\"crm.schemas.companies.write\"\n]\n7\n}\nRotate your access token\nIf you access token is lost or otherwise compromised, you can rotate the token. A new access token will be created and the original access token will expire.\nIn your HubSpot account, click the"
  },
  {
    "content": "If you access token is lost or otherwise compromised, you can rotate the token. A new access token will be created and the original access token will expire.\nIn your HubSpot account, click the\nSettings\npage in the main navigation bar.\nNavigate to\nIntegrations\n>\nPrivate Apps\n.\nClick the\nname\nof your private app.\nNext to your access token, click\nRotate\n:\nIf your token is compromised and you want to immediately revoke access, click\nRotate and expire now\n.\nIf there's no imminent threat to your token, it's still recommended that you rotate your token every six months. If you're ready to initiate a regular rotation of your token, click\nRotate and expire later\n, which will trigger an expiration of the token in 7 days.\nIf your app is ready to transition earlier, you can click\nExpire now\n.\nIf you decide you need more time, you can click\nCancel rotation\n, which will cancel the expiration of the original token and revoke the new access token.\nHubSpot will also send email notifications to"
  },
  {
    "content": "If you decide you need more time, you can click\nCancel rotation\n, which will cancel the expiration of the original token and revoke the new access token.\nHubSpot will also send email notifications to\nsuper admins\nwith reminders about access token rotation status, as well as other related alerts. Super admins in your HubSpot account will receive notifications for the following events and reminders:\nA super admin initiated a rotation (either immediately or scheduled for 7 days from now).\nA super admin canceled a pending rotation.\nA super admin opted to expire an access token immediately by clicking\nExpire now\ninstead of waiting 7 days for the token to expire.\nThe app's access token is about to expire in 24 hours.\nThe app's access token has been rotated and expired after 7 days.\nIf you haven't rotated your access token in over 180 days, super admins will also receive a reminder email to rotate your app's access token.\nView API call logs"
  },
  {
    "content": "If you haven't rotated your access token in over 180 days, super admins will also receive a reminder email to rotate your app's access token.\nView API call logs\nTo review the API calls your app has made in the past 30 days:\nOn the details page of your app, click the\nLogs\ntab.\nReview and filter your private app API calls:\nClick the\nMethod\nand\nResponse\ndropdown menus to filter your historical API calls by request method or response code.\nClick the\nstart date\nor\nend date\ndropdown menus to narrow your call logs to a specific time range.\nYou can also search for specific calls by URL in the\nSearch by request URL\nsearch box.\nPlease note:\nHubSpot does not store the request body, request URL parameters, or response payload of successful API calls in the logs for private apps. If you want to track this data, or you want to store log data from more than 30 days ago, it's recommended that you maintain an external log of your app's historical calls.\nTo export the API call logs, click"
  },
  {
    "content": "To export the API call logs, click\nExport logs (CSV)\n. Then, specify a\ndate range\n(up to the past 30 days) and click\nExport\n.\nIn the pop-up box, select the\ndate range\nof API calls you want to export and click\nExport\n. You will receive an email with a download link when the export is ready.\nPrivate app limits\nYou can create up to 20 private apps in your HubSpot account. Each private app is subject to\nHubSpot's API usage guidelines\n. The number of calls your private app can make is based on your account subscription and whether you've purchased the API add-on:\nProduct Tier\nPer 10 Seconds\nPer Day\nPrivate Apps\n(Any Hub)Free and Starter\n100 / private app\n250,000 / account\n(Any Hub)Professional\n190 / private app\n625,000 / account\n(Any Hub)Enterprise\n190 / private app\n1,000,000 / account\nPrivate Apps with\nAPI Limit Increase\n(Any Hub)Free, Starter, Professional, and Enterprise\n200 / private app"
  },
  {
    "content": "625,000 / account\n(Any Hub)Enterprise\n190 / private app\n1,000,000 / account\nPrivate Apps with\nAPI Limit Increase\n(Any Hub)Free, Starter, Professional, and Enterprise\n200 / private app\n1,000,000 / account on top of your base subscription, for each limit increase. You can purchase a maximum of two API limit increase.\nIf you have both a Starter and Professional plan, limits for the higher tier (Professional) apply to your account.\nYou can make a\nGET\nrequest to\n/account-info/v3/api-usage/daily/private-apps\nto review the daily API usage for all private apps in your HubSpot account. Learn more about using the\naccount information API\n.\nPlease note:\nPurchasing an API Limit Increase will increase the maximum number of requests you can make to the\nassociations API\nto 1,000,000 daily requests and 200 requests per 10 seconds, but these limits\ncannot\nbe increased further with an additional API Limit Increase purchase.\nDelete a private app"
  },
  {
    "content": "associations API\nto 1,000,000 daily requests and 200 requests per 10 seconds, but these limits\ncannot\nbe increased further with an additional API Limit Increase purchase.\nDelete a private app\nWhen you delete one of your private apps, its access token will be permanently revoked and you'll no longer be able to use it to make API calls.\nTo delete an app:\nIn your HubSpot account, click the\nsettings icon\nin the main navigation bar.\nClick the\nname\nof your private app.\nAt the top of the page, click the\nAuth\ntab.\nAt the bottom of the page, click\nDelete [name of your app]\n.\nIn the dialog box, type the name of your app to confirm its deletion, then click\nDelete\n."
  },
  {
    "content": "--- FIM DA PÁGINA ---"
  }
]